#######################匯入模組#######################
# 匯入 tkinter 模型
from tkinter import *
import sys
import os

#######################設定工作目錄####################
# 設定工作目錄
os.chdir(sys.path[0])

#######################建立視窗########################
# 建立視窗
windows = Tk()

# 設定視窗名稱
windows.title("My first GUI")

#######################建立畫布########################
# 建立畫布,寬度為600,高度為600
canva = Canvas(windows, width=600, height=600, bg="white")

# 將畫布加入主視窗中
canva.pack()

#######################設定視窗圖片#######################
# 設定視窗圖片
windows.iconbitmap("crocodile2.ico")
#######################載入圖片#######################
img = PhotoImage(file="crocodile2.png")

#######################顯示圖片#######################
my_img = canva.create_image(300, 300, image=img)

#######################運行應用程式########################
# 開始運行應用程式,讓視窗保持顯示
windows.mainloop()
